app/controllers/api/games_controller.rb

SELECT `games`.* FROM `games` WHERE `games`.`user_id` = 5
---
  def index

    @games = Game.where({:user_id=>get_user})

INSERT INTO `games` (`rows`, `columns`, `name`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["rows", "50"], ["columns", "50"], ["name", "Balls on my c"], ["user_id", 5], ["created_at", "2015-08-11 22:15:28"], ["updated_at", "2015-08-11 22:15:28"]]
INSERT INTO `living_cells` (`row`, `column`, `game_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["row", 0], ["column", 0], ["game_id", 30], ["created_at", "2015-08-12 21:39:07"], ["updated_at", "2015-08-12 21:39:07"]]
SELECT `games`.* FROM `games` WHERE `games`.`user_id` = 5
---
  def create
    @game = Game.new(params[:game].permit(:rows, :columns, :name))
    @game.user = get_user
    @game.save!

    @living_cells = params[:living_cells]
    @living_cells.each_with_index do |pair, idx|
      coord_array = pair.last
      @cell = LivingCell.new({:row=>coord_array[0], :column=>coord_array[1]})
      @cell.game = @game
      @cell.save!
    end

    @games = Game.where({:user_id=>get_user})

SELECT  `games`.* FROM `games` WHERE `games`.`id` = ? LIMIT 1  [["id", 46]]
DELETE FROM `games` WHERE `games`.`id` = ?  [["id", 46]]
SELECT `games`.* FROM `games` WHERE `games`.`user_id` = 5
---
  def destroy
    @game = Game.find(params[:id])
    if @game.user == get_user
      @game.destroy
    end

    @games = Game.where({:user_id=>get_user})

SELECT  `games`.* FROM `games` WHERE `games`.`id` = NULL LIMIT 1
---
  def show
    @game = Game.find(params[:id])