app/controllers/api/users_controller.rb

    def create
        @user = User.new(params[:user].permit(:name, :password))
        @user.save!
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["name", "ol"], ["password_digest", "$2a$10$vQe7xfiKkwAV213jSZD/4uHqM.nf/tTydN5XtdTjdtjRwe2.XeNeK"], ["created_at", "2015-08-08 18:17:37"], ["updated_at", "2015-08-08 18:17:37"]]

    def verify
        user_params = params[:user].permit(:name, :password)
        @user = User.find_by(name: user_params[:name]).try(:authenticate, user_params[:password])
        if @user
          @token = LoginToken.new
          time = Time.new
          login_token = "catbakescookies" + time.to_s + @user.name
          login_token_hash = BCrypt::Password.create(login_token)
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = ? LIMIT 1  [["name", "ola"]]
INSERT INTO `login_tokens` (`token`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["token", "$2a$10$tdQGvpNlqegTEUCqLYEis.Lt.IgaPxZVGwz.aTMuAAefvM6NLmb4C"], ["user_id", 5], ["created_at", "2015-08-10 22:09:05"], ["updated_at", "2015-08-10 22:09:05"]]